---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.SweepBaseOffset
source: html/9f2c7104-0eb5-09cd-c49e-5628f174f54d.htm
---
# Autodesk.Revit.DB.ParameterTypeId.SweepBaseOffset Property

"Horizontal Profile Offset"

## Syntax (C#)
```csharp
public static ForgeTypeId SweepBaseOffset { get; }
```